[
  {
    "text": "GLAME — это бренд украшений премиум-класса, который создает уникальные изделия для современных женщин, ценящих элегантность и индивидуальность.",
    "category": "brand_philosophy",
    "source": "brand_guide"
  },
  {
    "text": "Наша миссия — помочь каждой женщине выразить свою уникальность через украшения, которые подчеркивают ее индивидуальный стиль и характер.",
    "category": "brand_philosophy",
    "source": "brand_guide"
  },
  {
    "text": "Мы используем только качественные материалы: золото 585 пробы, серебро 925 пробы, натуральные камни и жемчуг.",
    "category": "materials",
    "source": "product_specs"
  },
  {
    "text": "Каждое украшение GLAME создается вручную опытными мастерами с многолетним опытом работы с драгоценными металлами.",
    "category": "craftsmanship",
    "source": "production_info"
  },
  {
    "text": "Наш стиль сочетает классическую элегантность с современными трендами, создавая вневременные украшения, которые будут актуальны годами.",
    "category": "style",
    "source": "brand_guide"
  },
  {
    "text": "Мы предлагаем персонализированные консультации по подбору украшений, учитывая стиль жизни, предпочтения и бюджет клиента.",
    "category": "service",
    "source": "service_guide"
  },
  {
    "text": "Все украшения GLAME поставляются в элегантной подарочной упаковке и сопровождаются сертификатом подлинности.",
    "category": "service",
    "source": "service_guide"
  },
  {
    "text": "Мы предоставляем гарантию на все изделия и предлагаем услуги по ремонту и реставрации украшений.",
    "category": "service",
    "source": "service_guide"
  },
  {
    "text": "Наши коллекции включают кольца, серьги, колье, браслеты и броши, выполненные в различных стилях: от минималистичных до роскошных.",
    "category": "collections",
    "source": "product_catalog"
  },
  {
    "text": "Мы регулярно выпускаем лимитированные коллекции, созданные в сотрудничестве с известными дизайнерами и художниками.",
    "category": "collections",
    "source": "brand_news"
  },
  {
    "text": "GLAME поддерживает этичное производство и использует только материалы от проверенных поставщиков, которые соблюдают экологические стандарты.",
    "category": "values",
    "source": "brand_guide"
  },
  {
    "text": "Наш бренд ориентирован на женщин от 25 до 55 лет, которые ценят качество, уникальность и осознанный подход к покупкам.",
    "category": "target_audience",
    "source": "marketing_research"
  },
  {
    "text": "Мы предлагаем украшения для различных случаев: повседневная носка, деловые встречи, романтические свидания, торжественные мероприятия.",
    "category": "use_cases",
    "source": "product_guide"
  },
  {
    "text": "Каждое украшение можно комбинировать с другими изделиями из нашей коллекции, создавая гармоничные комплекты.",
    "category": "styling",
    "source": "styling_guide"
  },
  {
    "text": "Мы предоставляем возможность индивидуального заказа украшений по эскизам клиента или в сотрудничестве с нашими дизайнерами.",
    "category": "custom_orders",
    "source": "service_guide"
  }
]
